content-org/blog.org
;; -*- mode: Org; org-download-image-dir: "../static/images/posts"; org-download-heading-lvl: 1; org-download-display-inline-images: nil; org-download-timestamp: "" -*-

#+TITLE: Posts
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE How to podcast :good:
CLOSED: [2019-04-15 Mon 16:23]
:PROPERTIES:
:EXPORT_FILE_NAME: how-to-podcast
:END:

Here is a TL;DR version:

1. Record using whatever. Even smartphones produce decent sound nowadays. Just make sure to have a consistent volume, i.e. maintain constant distance between your mouth and the phone.
2. Compress to 96kbps mp3 constant bitrate. Or use an online encoder like [[https://pinecoder.pinecast.com/][Pinecoder]].
3. Pick a podcast hosting provider:
   1. [[https://pinecast.com][pinecast.com]]: starts at $5/month with unlimited storage, unlimited shows, basic analytics and website generator.
   2. [[https://simplecast.com/][simplecast.com]]: starts at $15/month per show. Cool player, website generator.
   3. [[https://transistor.fm/][transistor.fm]]: starts at $19/month with unlimited storage, unlimited shows. Limited at 5k downloads per month.
   4. Or one of many others, including [[https://www.podbean.com/][podbean]], [[https://www.libsyn.com/][libsyn]], [[https://fireside.fm/][fireside]] or even [[https://soundcloud.com/for/podcasting][soundcloud]] (probably not the best idea, since the company's finances aren't great)
4. Add your podcast to public catalogs:
   1. [[https://podcastsconnect.apple.com/][Apple Podcasts (iTunes)]]
   2. [[https://podcasters.spotify.com/][Spotify]]
   3. [[https://pocketcasts.com/submit][PocketCasts]]
   4. [[https://play.google.com/music/podcasts/portal/][Google Podcasts]]
   5. [[https://player.fm/importer/feed][Player FM]]
   6. [[https://help.tunein.com/contact/add-podcast-S19TR3Sdf][TuneIn]]

   Some podcast hosting providers can submit your feed to those catalogs on your behalf, but I suggest you do everything manually to keep 100% control over your content.

*** Preparation

This part is very subjective, so I'll just describe my own process.

Since each of my episodes follows a specific topic, I start thinking about it weeks before, just allowing ideas, thoughts and just random pieces of info simmer in my head for hours. I do my best to write down these things, but often just forget them. It's okay. I have learned to let go of "obviously genius" ideas.

I never hesitate to write down whatever comes to mind though. It could be an analogy, a funny phrase, a weird comparison.

At some point I feel ready to jot down the structure. I've been using a large notepad and iPad pro with Apple Pencil, but lately have been enjoying [[https://mindnode.com/][MindNode]] on the desktop. Having a large, tree-like structure fits my way of thinking very well. I just "walk" the tree during recording, trying to visit all the nodes.

*** Recording

There are different levels here.

**** Level 1: Just use whatever.

Your phone or internal microphone of your laptop are /okay/. Not great by any means, but keep these in mind and you'll be fine:
- Pick a quiet spot. Humming noises are the worst (loud fridge, AC, etc.)
- Maintain constant distance between your mouth and the mic
- If possible, record in a smaller room with lots of soft objects to minimize echo. Books, blankets, pillows, curtains reduce echo significantly.

**** Level 2: USB headset

A good and cheap way to improve your sound significantly is using almost any good USB headset. But it /must/ be USB. Those headsets that connect via jack cables are simply using your computer's audio card and the sound might not be much better than with an internal mic.

**** Level 3: USB microphone

USB mics are the combination of "real" microphones and the convenience of USB. You usually don't need anything else, just plug and play.

There are several good choices in this category:

1. [[http://www.rode.com/microphones/podcaster][Rode Podcaster]] (my only mic for 10+ years, produced hundreds of podcasts and videos with it)
2. [[https://www.bluedesigns.com/products/yeti/][Blue Yeti]]
3. Audio-Technica ATR2100-USB
4. Shure PG42-USB
5. Audio-Technica AT2020USB+

**** Level 4: XLR microphone

When you're ready to go "full podcaster", go read [[https://marco.org/podcasting-microphones][Marco Arment's Podcasting Microphones Mega-Review]]. There are audio samples, too.

*** Editing

I edit my podcasts heavily. 60 minutes of recording usually result in about 35-45 minutes of end result. Marco Arment wrote about this in [[https://marco.org/2014/11/29/easy-listening][Easy listening]] and I agree: "you just need to care".

Free and open source [[https://www.audacityteam.org/download/][Audacity]] is more than capable for both recording and editing, but, to be honest, I find it extremely cumbersome and ugly. Once you're serious, I think it's worth to invest into buying and learning a tool like Adobe Audition (my choice) or Apple Logic Pro X.

*** Publishing

Podcast is basically an RSS feed with media files. You can generate it yourself and host mp3 files wherever. If you already have a blog running on Wordpress, it makes sense to just continue using it. On wordpress.com they have a [[https://en.support.wordpress.com/audio/podcasting/][special feature for podcasting]], and if you run your own wordpress instance, [[https://wordpress.org/plugins/seriously-simple-podcasting/][this plugin]] will help you.

It is much easier to use one of the specialized hosting providers:

1. [[https://pinecast.com][pinecast.com]]: starts at $5/month with unlimited storage, unlimited shows, basic analytics and website generator.
2. [[https://simplecast.com/][simplecast.com]]: starts at $15/month per show. Cool player, website generator.
3. [[https://transistor.fm/][transistor.fm]]: starts at $19/month with unlimited storage, unlimited shows. Limited at 5k downloads per month.
4. Or one of many others, including [[https://www.podbean.com/][podbean]], [[https://www.libsyn.com/][libsyn]], [[https://fireside.fm/][fireside]] or even [[https://soundcloud.com/for/podcasting][soundcloud]] (probably not the best idea, since the company's finances aren't great)

Most of them can even generate websites for your shows, although, their design choices are questionable at times.

All of my shows are hosted by pinecast: it's a fantastic value for the money and everything works perfectly fine. Here is my referral coupon code for 40% off for 4 months: =r-a6562b=. Use it at checkout.

*** Questions?

Feel free to email me at contact@rakhim.org, and I'll try to add more info to this guide.
